TRAFFIC_KEYWORDS = [
    /\bдтп|\bпроисшеств.+|\bавар.+|\bстолкнов.+/,
    /\bгибдд|\bугибдд|\bгаи|\bдтп|\bгосавтоинспекц.+/,
    /\bводител.+|\bпассажир.*|\bпешеход.*|\bрулем/,
    /\bулиц.*|\bтрасс.*|\bперекрест.+|\bзебр.*/,
    /\bавтомобил.+|\bавтобус.*/,
    /\bгильмутдинов.*/,
    /\bврезалс.+|\bсбил.*|\bзадав.+|\bстолкнулс.+/,
    /\bсостоян.+|\bтрезв.+|\bнетрезв.+|\bалкогол.+|\bпромилле|\bосвидетельств.+|\bопьян.+|\bпьян.*/,
    /\bскончал.+|\bпогиб.*|\bсмерт.+|\bгоспитал.+|\bтравм.*|\bпострад.+/
]

SPORT_KEYWORDS = [
    /\bнефтехимик.*|\bсеверсталь.*|\bсалават.*|\bюлаев.*|\bтолпар.*|\bтрактор.*|\bбарс.*|\bдинамо/,
    /\bфорвард.*|\bвратар.+|\bголкипер.*|\bбомбардир.*|\bарбитр.*|\bчемпион.*|\bзащитник.*|\bнапад.+/,
    /\bлед|\bльд.+|\bмяч.*|\bшайб.*|\bсборн.+|\bматч.*|\bсчет.*|\bкоманд.*|\bворот.*|\bпенальт.*|\bгол.*/,
    /\bхокке.+|\bфутбол.*|\bбаскетбол.*|\bлиг.+|\bкубок|\bкубк.+|\bфк|\bхк|\bклуб|\bплей.*офф|\bтренер.*|\bштаб|\bсуперкуб.*|\b(н|к)хл|\bболельщ.+|\bпауэрлифт.+/,
    /\bсыгра.+|\bгост.+|\bпоражен.+|\bтрениров.+|\bмолодежн.+|\bзабро.+|\bпоби.+|\bразгром.*|\bничь.+|\bпобед.+|\b.*кратн.*|\bсезон.*|\bспорт.*/
]

GOV_KEYWORDS = [
    /\bхабиров.*|\bради.*|\bназаров.*|\bглав.{1,2}\b|\bвице.*/,
    /\bчиновни.+|\bгуберн.+|\bпремьер.*|\bначальн.+|\bдепут.+|\bзаместител.+/,
    /\bправительств.*|\bадминистр.+|\bпрокур.*|\bминист.+/
]