require 'yaml'

KEYWORDS = [
    /\bдтп|\bпроисшеств.+|\bавар.+|\bстолкнов.+/,
    /\bгибдд|\bугибдд|\bгаи|\bдтп|\bгосавтоинспекц.+/,
    /\bводител.+|\bпассажир.*|\bпешеход.*|\bрулем/,
    /\bулиц.*|\bтрасс.*|\bперекрест.+|\bзебр.*/,
    /\bавтомобил.+|\bавтобус.*/,
    /\bгильмутдинов.*/,
    /\bврезалс.+|\bсбил.*|\bзадав.+|\bстолкнулс.+/,
    /\bсостоян.+|\bтрезв.+|\bнетрезв.+|\bалкогол.+|\bпромилле|\bосвидетельств.+|\bопьян.+|\bпьян.*/,
    /\bскончал.+|\bпогиб.*|\bсмерт.+|\bгоспитал.+|\bтравм.*|\bпострад.+/,

    /\bнефтехимик.*|\bсеверсталь.*|\bсалават.*|\bюлаев.*|\bтолпар.*|\bтрактор.*|\bбарс.*|\bдинамо/,
    /\bфорвард.*|\bвратар.+|\bголкипер.*|\bбомбардир.*|\bарбитр.*|\bчемпион.*|\bзащитник.*|\bнапад.+/,
    /\bлед|\bльд.+|\bмяч.*|\bшайб.*|\bсборн.+|\bматч.*|\bсчет.*|\bкоманд.*|\bворот.*|\bпенальт.*|\bгол.*/,
    /\bхокке.+|\bфутбол.*|\bбаскетбол.*|\bлиг.+|\bкубок|\bкубк.+|\bфк|\bхк|\bклуб|\bплей.*офф|\bтренер.*|\bштаб|\bсуперкуб.*|\b(н|к)хл|\bболельщ.+|\bпауэрлифт.+/,
    /\bсыгра.+|\bгост.+|\bпоражен.+|\bтрениров.+|\bмолодежн.+|\bзабро.+|\bпоби.+|\bразгром.*|\bничь.+|\bпобед.+|\b.*кратн.*|\bсезон.*|\bспорт.*/,

    /\bхабиров.*|\bради.*|\bназаров.*|\bглав.{1,2}\b|\bвице.*/,
    /\bчиновни.+|\bгуберн.+|\bпремьер.*|\bначальн.+|\bдепут.+|\bзаместител.+/,
    /\bправительств.*|\bадминистр.+|\bпрокур.*|\bминист.+/
]

def compute_freqs
  freqs = []
  ['1_traffic', '2_sport', '3_gov'].each do |category|
    ['1_utv', '2_rg','3_kommersant'].each do |folder|
      Dir.glob("#{folder}/#{category}/*.txt").each do |text_file_path|
        File.open(text_file_path, 'r') do |text_file|
          puts text_file_path
          matches = []
          content = text_file.read
          content.downcase!
          content.gsub!(/ё/,'е')
          content.gsub!(/[^А-я0-9]|\s{2,}/,' ')
          content.strip!
          KEYWORDS.each do |keyword|
            matches << content.scan(keyword).length
          end
          freqs << [matches, category[0].to_i]
          end
      end
    end
  end
  25.times {freqs << [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 4]}
  File.open('input_output.yml', 'w') { |file| file.write(freqs.to_yaml) }
end

compute_freqs

